#### Importing Libraries

In [1]:
import pandas as pd

#### Importing Data

In [2]:
df = pd.read_csv('data/house_data.csv')

In [3]:
df

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors
0,7.129301e+09,20141013T000000,221900.0,3.0,1.00,1180.0,5650.0,1.0
1,6.414100e+09,20141209T000000,538000.0,3.0,2.25,2570.0,7242.0,2.0
2,5.631500e+09,20150225T000000,180000.0,2.0,1.00,770.0,10000.0,1.0
3,2.487201e+09,20141209T000000,604000.0,4.0,3.00,1960.0,5000.0,1.0
4,1.954401e+09,20150218T000000,510000.0,3.0,2.00,1680.0,8080.0,1.0
...,...,...,...,...,...,...,...,...
21602,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
21603,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
21604,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
21605,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
21606,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

#### Analyzing Data

In [4]:
rows, columns = df.shape

In [5]:
rows

21607

In [6]:
columns

8

In [7]:
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors
0,7.129301e+09,20141013T000000,221900.0,3.0,1.00,1180.0,5650.0,1.0
1,6.414100e+09,20141209T000000,538000.0,3.0,2.25,2570.0,7242.0,2.0
2,5.631500e+09,20150225T000000,180000.0,2.0,1.00,770.0,10000.0,1.0
3,2.487201e+09,20141209T000000,604000.0,4.0,3.00,1960.0,5000.0,1.0
4,1.954401e+09,20150218T000000,510000.0,3.0,2.00,1680.0,8080.0,1.0

In [8]:
df.tail()

       id date  price  bedrooms  bathrooms  sqft_living  sqft_lot  floors
21602 NaN  NaN    NaN       NaN        NaN          NaN       NaN     NaN
21603 NaN  NaN    NaN       NaN        NaN          NaN       NaN     NaN
21604 NaN  NaN    NaN       NaN        NaN          NaN       NaN     NaN
21605 NaN  NaN    NaN       NaN        NaN          NaN       NaN     NaN
21606 NaN  NaN    NaN       NaN        NaN          NaN       NaN     NaN

In [9]:
df.describe()

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors
count,9.900000e+01,9.900000e+01,99.000000,99.000000,99.000000,99.000000,99.000000
mean,4.664620e+09,5.200763e+05,3.404040,1.989899,2086.383838,11478.818182,1.464646
std,2.935212e+09,3.061939e+05,0.794358,0.729236,864.592421,14655.249813,0.511363
min,1.600040e+07,1.530000e+05,2.000000,1.000000,770.000000,1044.000000,1.000000
25%,1.914950e+09,3.070000e+05,3.000000,1.500000,1410.000000,5000.000000,1.000000
50%,4.036801e+09,4.300000e+05,3.000000,2.000000,1900.000000,6720.000000,1.500000
75%,7.337325e+09,6.562500e+05,4.000000,2.500000,2570.000000,9823.000000,2.000000
max,9.822700e+09,2.000000e+06,5.000000,4.500000,5420.000000,101930.000000,3.000000

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21607 entries, 0 to 21606
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           99 non-null     float64
 1   date         99 non-null     object
 2   price        99 non-null     float64
 3   bedrooms     99 non-null     float64
 4   bathrooms    99 non-null     float64
 5   sqft_living  99 non-null     float64
 6   sqft_lot     99 non-null     float64
 7   floors       99 non-null     float64
dtypes: float64(7), object(1)
memory usage: 1.3+ MB

#### Renaming Columns

In [11]:
df.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors'],
      dtype='object')

In [12]:
df.rename(columns = {'bedrooms':'no_of_bedrooms','bathrooms':'no_of_bathrooms','floors':'no_of_floors'}, inplace = True)

In [13]:
df.columns

Index(['id', 'date', 'price', 'no_of_bedrooms', 'no_of_bathrooms',
       'sqft_living', 'sqft_lot', 'no_of_floors'],
      dtype='object')

In [14]:
df[['price', 'sqft_living', 'sqft_lot']]

          price  sqft_living  sqft_lot
0      221900.0       1180.0    5650.0
1      538000.0       2570.0    7242.0
2      180000.0        770.0   10000.0
3      604000.0       1960.0    5000.0
4      510000.0       1680.0    8080.0
...         ...          ...       ...
21602       NaN          NaN       NaN
21603       NaN          NaN       NaN
21604       NaN          NaN       NaN
21605       NaN          NaN       NaN
21606       NaN          NaN       NaN

[21607 rows x 3 columns]

#### Removing NaN values

In [15]:
df.isna().sum()

id                 21508
date               21508
price              21508
no_of_bedrooms     21508
no_of_bathrooms    21508
sqft_living        21508
sqft_lot           21508
no_of_floors       21508
dtype: int64

In [16]:
# Removing rows with all values as NaN
df = df.dropna(how='all')

In [17]:
df.isna().sum()

id                 0
date               0
price              0
no_of_bedrooms     0
no_of_bathrooms    0
sqft_living        0
sqft_lot           0
no_of_floors       0
dtype: int64

In [18]:
df

,id,date,price,no_of_bedrooms,no_of_bathrooms,sqft_living,sqft_lot,no_of_floors
0,7.129301e+09,20141013T000000,221900.0,3.0,1.00,1180.0,5650.0,1.0
1,6.414100e+09,20141209T000000,538000.0,3.0,2.25,2570.0,7242.0,2.0
2,5.631500e+09,20150225T000000,180000.0,2.0,1.00,770.0,10000.0,1.0
3,2.487201e+09,20141209T000000,604000.0,4.0,3.00,1960.0,5000.0,1.0
4,1.954401e+09,20150218T000000,510000.0,3.0,2.00,1680.0,8080.0,1.0
...,...,...,...,...,...,...,...,...
94,6.021502e+09,20141223T000000,700000.0,3.0,1.50,1580.0,5000.0,1.0
95,1.483301e+09,20140908T000000,905000.0,4.0,2.50,3300.0,10250.0,1.0
96,3.422049e+09,20150330T000000,247500.0,3.0,1.75,1960.0,15681.0,1.0
97,1.099611e+09,20140912T000000,199000.0,4.0,1.50,1160.0,6400.0,1.0
98,7.220791e+08,20140711T000000,314000.0,3.0,1.75,1810.0,41800.0,1.0

#### Analysing our output variable price

In [19]:
df.price.max()

2000000.0

In [20]:
df.price.min()

153000.0

In [21]:
df.price.mean()

520076.31313131313

In [22]:
df.count()

id                 99
date               99
price              99
no_of_bedrooms     99
no_of_bathrooms    99
sqft_living        99
sqft_lot           99
no_of_floors       99
dtype: int64

In [23]:
df.price.count()

99

In [24]:
df.price.value_counts()

360000.0     2
650000.0     2
430000.0     2
252700.0     1
356000.0     1
            ..
335000.0     1
1230000.0    1
549000.0     1
438000.0     1
180000.0     1
Name: price, Length: 96, dtype: int64

##### Let's check number of unique prices of houses

df.price.unique()

In [25]:
unique = df.price.unique()

In [26]:
len(unique)

96

#### Other intutions from this data

##### Price of houses with minimum and maximum price

In [27]:
df[df['price']==df['price'].max()][['no_of_bedrooms','no_of_bathrooms','sqft_living','sqft_lot','no_of_floors','price']]

,no_of_bedrooms,no_of_bathrooms,sqft_living,sqft_lot,no_of_floors,price
21,3.0,2.75,3050.0,44867.0,1.0,2000000.0

In [28]:
df[df['price']==df['price'].min()][['no_of_bedrooms','no_of_bathrooms','sqft_living','sqft_lot','no_of_floors','price']]

,no_of_bedrooms,no_of_bathrooms,sqft_living,sqft_lot,no_of_floors,price
92,3.0,1.0,1200.0,10500.0,1.0,153000.0

In [29]:
df

,id,date,price,no_of_bedrooms,no_of_bathrooms,sqft_living,sqft_lot,no_of_floors
0,7.129301e+09,20141013T000000,221900.0,3.0,1.00,1180.0,5650.0,1.0
1,6.414100e+09,20141209T000000,538000.0,3.0,2.25,2570.0,7242.0,2.0
2,5.631500e+09,20150225T000000,180000.0,2.0,1.00,770.0,10000.0,1.0
3,2.487201e+09,20141209T000000,604000.0,4.0,3.00,1960.0,5000.0,1.0
4,1.954401e+09,20150218T000000,510000.0,3.0,2.00,1680.0,8080.0,1.0
...,...,...,...,...,...,...,...,...
94,6.021502e+09,20141223T000000,700000.0,3.0,1.50,1580.0,5000.0,1.0
95,1.483301e+09,20140908T000000,905000.0,4.0,2.50,3300.0,10250.0,1.0
96,3.422049e+09,20150330T000000,247500.0,3.0,1.75,1960.0,15681.0,1.0
97,1.099611e+09,20140912T000000,199000.0,4.0,1.50,1160.0,6400.0,1.0
98,7.220791e+08,20140711T000000,314000.0,3.0,1.75,1810.0,41800.0,1.0

#### Price of House with max square feet

In [30]:
df[df['sqft_lot']==df['sqft_lot'].max()][['no_of_bedrooms','no_of_bathrooms','sqft_living','sqft_lot','no_of_floors','price']]

,no_of_bedrooms,no_of_bathrooms,sqft_living,sqft_lot,no_of_floors,price
5,4.0,4.5,5420.0,101930.0,1.0,1230000.0

#### Price of House with maximum floors

In [31]:
df[df['no_of_floors']==df['no_of_floors'].max()][['no_of_bedrooms','no_of_bathrooms','sqft_living','sqft_lot','no_of_floors','price']]

,no_of_bedrooms,no_of_bathrooms,sqft_living,sqft_lot,no_of_floors,price
31,2.0,1.50,1190.0,1265.0,3.0,280000.0
63,3.0,1.75,1540.0,1044.0,3.0,549000.0

#### List of Houses with maximum bedrooms

In [32]:
df[df['no_of_bedrooms']==df['no_of_bedrooms'].max()][['no_of_bedrooms','no_of_bathrooms','sqft_living','sqft_lot','no_of_floors','price']]

,no_of_bedrooms,no_of_bathrooms,sqft_living,sqft_lot,no_of_floors,price
14,5.0,2.00,1810.0,4850.0,1.5,530000.0
22,5.0,2.50,2270.0,6300.0,2.0,285000.0
42,5.0,2.75,3595.0,5639.0,2.0,861990.0
51,5.0,2.50,3150.0,9134.0,1.0,345000.0
54,5.0,2.25,2730.0,6000.0,1.5,920000.0
58,5.0,3.25,3250.0,14342.0,2.0,951000.0
69,5.0,2.25,3200.0,20158.0,1.0,1330000.0
70,5.0,3.25,4770.0,50094.0,1.0,1040000.0
86,5.0,2.25,2660.0,8400.0,1.5,305000.0
91,5.0,2.75,3520.0,6353.0,2.0,1100000.0

#### Splitting training and testing data into 1:3 ratio

In [33]:
from sklearn.model_selection import train_test_split

In [34]:
df.corr()

,id,price,no_of_bedrooms,no_of_bathrooms,sqft_living,sqft_lot,no_of_floors
id,1.000000,-0.032272,0.061365,-0.016291,0.002315,-0.132259,0.085209
price,-0.032272,1.000000,0.353106,0.468229,0.652138,0.464751,0.074981
no_of_bedrooms,0.061365,0.353106,1.000000,0.491538,0.562724,0.129634,0.148566
no_of_bathrooms,-0.016291,0.468229,0.491538,1.000000,0.790412,0.366090,0.368444
sqft_living,0.002315,0.652138,0.562724,0.790412,1.000000,0.500501,0.222844
sqft_lot,-0.132259,0.464751,0.129634,0.366090,0.500501,1.000000,-0.253837
no_of_floors,0.085209,0.074981,0.148566,0.368444,0.222844,-0.253837,1.000000

In [35]:
X = df[['no_of_bedrooms','no_of_bathrooms','sqft_living','sqft_lot','no_of_floors']]
y = df[['price']]

In [36]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.25, random_state=56)

In [37]:
X_train.shape, X_test.shape, y_train.shape, y_test.shape

((74, 5), (25, 5), (74, 1), (25, 1))

#### Splitting through Pandas

In [38]:
df1 = df.copy()

In [39]:
train = df1.sample(frac=0.75, random_state=56)
test = df1.drop(train.index)

In [40]:
train.count()

id                 74
date               74
price              74
no_of_bedrooms     74
no_of_bathrooms    74
sqft_living        74
sqft_lot           74
no_of_floors       74
dtype: int64

In [41]:
test.count()

id                 25
date               25
price              25
no_of_bedrooms     25
no_of_bathrooms    25
sqft_living        25
sqft_lot           25
no_of_floors       25
dtype: int64

In [42]:
train.to_csv('data/train_data.csv')
test.to_csv('data/test_data.csv')